{"SUBREDDIT: r/relationships\nTITLE: Me [24 m] missing my first ex [21 f] after 5 months of break up.\nPOST: Hello Reddit\nJust throwing this post out there just to let it out of my system.\nSo I have been dating this girl (my first girlfriend. I was her first) for 3 years. We had an awesome time and sometimes rough ups and downs. In the end, it didn't work out.\nI knew I loved her and she loved me but things just didn't work out due to both separate reasons.\n\nSo it has been almost 5 months. I got over the hardest time of my life which was post break up of first 2 months. \nNow after 5 months, I just miss her.\nI guess there hasn't been a single where I haven't thought about her yet. lol  \nI know I shouldn't contact her and I'm pretty sure she won't contact me either which is for the better.\nWe haven't spoken for maybe 2 months? something like that.\nYesterday, I just couldn't handle it anymore and looked at our photos on my google photos which I never get on.\nIt was nice to see her face again and reminisce the old days.\nIt was nice to see the dogs we both love now living with her family.\nThroughout all 5 months, my career picked up. I got a promotion \nsaved up a lot of money and did things around the house I haven't been able to etc etc.\nBut I just miss her.\nI know she's doing well, probably better than before.\nIs it just me? \nAnyway thanks for your time reading this and appreciate your comments.\nTL;DR:": [[" Miss my first girlfriend after 5 months of break up. I guess there hasn't been a single where I haven't thought about her yet. lol  ", " It's been 5 months since my ex of 3 years and I broke up. I miss her. Is it just me?", " Still miss my first girlfriend after 5 months of break up. I know I shouldn't contact her and she won't contact me either.", " Missing my first girlfriend after 5 months of break up. Just posting this to let it out of my system. Thanks for your time.", " 5 months after break up, I still miss my first gf. Is it just me? What should I do?", " Missing my first ex girlfriend of 3 years after 5 months of break up. Is it just me? Or should I feel this way.", " Miss my first ex after 5 months of break up. Is it just me? Any advice or comments are welcome. Thank you.", " Miss my first ex girlfriend after 5 months of break up. I feel like I'm going through the hardest time of my life again.", " Miss first ex after 5 months of break up. Don't know why I'm feeling this way or what to do.", " Miss my ex after 5 months of breakup. She's doing well and I'm doing well. But still miss her.", " Ex of 3 years and I broke up 5 months ago. I'm missing her after 5 months of break up. Is it me?", " Miss my first ex after 5 months of break up.  Haven't spoken for 2 months. Just need to let it out.", " Just miss my first ex after 5 months of break up.  Not sure if this is just me or not. Is it just me?", " Been 5 months since we broke up. Now missing her after looking at her photos in google photos. Is it just me?", " It's been almost 5 months and I just miss my first ex. Is it normal to just miss her? ", " Still miss my first ex-girlfriend who I dated for 3 years after 5 months of break up. Just want to get this off my chest.", " 5 months after the break up, I still miss her. Is it just me?  Should I contact her?  ", " miss my first gf of 3 years after 5 months of break up. Did I do the right thing in letting it go?", " miss my first gf after 5 months of break up.  Haven't spoken in months.  Is it me?", " I miss my first girlfriend after 5 months of break up. Don't think I will contact her. just need to get this off my chest.", " Miss my first girlfriend and first love after 5 months. I know I shouldn't contact her. Should I just forget her?", " Been broken up with girlfriend for 5 months. It's my first relationship. I'm missing her. Is it just me?", " Missing my first ex after 5 months of break up. I know she doesn't miss me at all yet I can't stop thinking about her.", " Been 5 months since break up. Just miss my first ex. Is it just me? or does it take more time than that?", " missing my first ex gf after 5 months of break up. Wondering if it's just me or is it really me.", " missing my first girlfriend after 5 months of break up. Haven't spoken to her in 2 months and no contact is best.", " Haven't spoken to my ex since break up.\nJust miss her.                                                 ", " Haven't spoken to first ex in 5 months. Miss her. Not sure why. Is it just me? Is it just normal?", " Was with my first girl for 3 years. It didn't work out and now it's been almost 5 months. I miss her. "]], "SUBREDDIT: r/relationship_advice\nTITLE: [23/M] Needs help with birthday gift for recent GF [21/F]\nPOST: I recently (about 2 months) started dating this woman. Tomorrow is her birthday, and although I've thought extensively about it, I just can't seem to figure out a truly thoughtful gift. I realize that asking the internet to help is sort of lame, but I'm on a tight schedule here. \nHere's some of the useful things i know about her:\n\n-21 y/o\n-born in the Phillipines, lived in Spain for 5 years (and misses it)\n-loves Radiohead, the Flaming Lips\n-likes tattoos, on accounta she has 10\n-works at the Buffalo Exchange (thrift store)\n-is planning to attend FIDM next semester (fashion school)\n-loves thai food\n-harry potter nerd (I am too)\n-recently got her iphone stolen (i can't afford to buy her an iphone, unfortunately)\n-likes doris day movies\n-she's turning 21, but isn't a big drinker, and neither am i.\n\nI'm just gonna be real, I live on a pretty tight budget (rent in San Francisco is a real bitch), so I can spend up to $100.\n\nDo you have any suggestions? There are some obvious things I could do, but I am trying my best to be thoughtful and creative.\n\nAlso, we're going to see the Hobbit tonight. Stoked.\nTL;DR:": [[" Miss my first girlfriend after 5 months of break up. I guess there hasn't been a single where I haven't thought about her yet. lol  ", " It's been 5 months since my ex of 3 years and I broke up. I miss her. Is it just me?", " Still miss my first girlfriend after 5 months of break up. I know I shouldn't contact her and she won't contact me either.", " Missing my first girlfriend after 5 months of break up. Just posting this to let it out of my system. Thanks for your time.", " 5 months after break up, I still miss my first gf. Is it just me? What should I do?", " Missing my first ex girlfriend of 3 years after 5 months of break up. Is it just me? Or should I feel this way.", " Miss my first ex after 5 months of break up. Is it just me? Any advice or comments are welcome. Thank you.", " Miss my first ex girlfriend after 5 months of break up. I feel like I'm going through the hardest time of my life again.", " Miss first ex after 5 months of break up. Don't know why I'm feeling this way or what to do.", " Miss my ex after 5 months of breakup. She's doing well and I'm doing well. But still miss her.", " Ex of 3 years and I broke up 5 months ago. I'm missing her after 5 months of break up. Is it me?", " Miss my first ex after 5 months of break up.  Haven't spoken for 2 months. Just need to let it out.", " Just miss my first ex after 5 months of break up.  Not sure if this is just me or not. Is it just me?", " Been 5 months since we broke up. Now missing her after looking at her photos in google photos. Is it just me?", " It's been almost 5 months and I just miss my first ex. Is it normal to just miss her? ", " Still miss my first ex-girlfriend who I dated for 3 years after 5 months of break up. Just want to get this off my chest.", " 5 months after the break up, I still miss her. Is it just me?  Should I contact her?  ", " miss my first gf of 3 years after 5 months of break up. Did I do the right thing in letting it go?", " miss my first gf after 5 months of break up.  Haven't spoken in months.  Is it me?", " I miss my first girlfriend after 5 months of break up. Don't think I will contact her. just need to get this off my chest.", " Miss my first girlfriend and first love after 5 months. I know I shouldn't contact her. Should I just forget her?", " Been broken up with girlfriend for 5 months. It's my first relationship. I'm missing her. Is it just me?", " Missing my first ex after 5 months of break up. I know she doesn't miss me at all yet I can't stop thinking about her.", " Been 5 months since break up. Just miss my first ex. Is it just me? or does it take more time than that?", " missing my first ex gf after 5 months of break up. Wondering if it's just me or is it really me.", " missing my first girlfriend after 5 months of break up. Haven't spoken to her in 2 months and no contact is best.", " Haven't spoken to my ex since break up.\nJust miss her.                                                 ", " Haven't spoken to first ex in 5 months. Miss her. Not sure why. Is it just me? Is it just normal?", " Was with my first girl for 3 years. It didn't work out and now it's been almost 5 months. I miss her. "]]}